app/controllers/guesses_controller.rb

  def new
    @songs = Song.all.shuffle
    @usernames = @songs.map { |song| song.user.username }.shuffle
---
SELECT "songs".* FROM "songs"
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "songs"."username" FROM "songs"

  def create
    Song.count.times do |index|
      guess = Guess.new
      guess.guesser_name = params['guesser_name']
      guess.song_id = params["guess_song_#{index}"]
      guess.username = params["guess_user_#{index}"]
      guess.save!
---
SELECT COUNT(*) FROM "songs"
INSERT INTO "guesses" ("guesser_name", "song_id", "username") VALUES (?, ?, ?)  [["guesser_name", "asdasdasdyx"], ["song_id", 0], ["username", "Verena"]]