app/controllers/rounds_controller.rb

INSERT INTO "rounds" ("topic") VALUES (?)  [["topic", "Hallo3"]]
---
  def create
    @round = Round.new(params.require("round").permit('topic'))
    save_status = @round.save()