app/controllers/songs_controller.rb

  def create
    @song = Song.new
    @song.user_id = current_user.id
    @song.name = params['song']['name']
    @song.url = params['song']['url']
    save_status = @song.save()
---
INSERT INTO "songs" ("username", "name", "url") VALUES (?, ?, ?)  [["username", "Konstantin"], ["name", "99 Luftballons"], ["url", "dsfaasdf"]]

  def thanks
    @name = Song.last.name
---
SELECT  "songs".* FROM "songs"  ORDER BY "songs"."id" DESC LIMIT 1